---
kind: property
id: P:Autodesk.Revit.DB.SunAndShadowSettings.ProjectLocationName
source: html/dabc3f88-77ac-aec9-01e4-3219d37f362a.htm
---
# Autodesk.Revit.DB.SunAndShadowSettings.ProjectLocationName Property

Identifies the name of the project location used by the SunAndShadowSettings element.

## Syntax (C#)
```csharp
public string ProjectLocationName { get; }
```